app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @message = "Welcome to blogs application"
    @articles = Article.all

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "my blog 2"], ["description", "my blog 2 created from html page"], ["created_at", "2016-10-08 08:08:15.259795"], ["updated_at", "2016-10-08 08:08:15.259795"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Title1_changed"], ["updated_at", "2016-10-08 08:33:17.628564"], ["id", 1]]
---
  def update
    if @article.update_attributes(article_params)